chat_system/app/controllers/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
    def index
        applications = Application.all

INSERT INTO `applications` (`name`, `token`, `created_at`, `updated_at`) VALUES ('App1', '3d64f8a4ab83338ed674da31e3752e0e', '2025-11-11 17:39:39.321526', '2025-11-11 17:39:39.321526')
---
    def create
        # generates a 32-character hex token.
        token = SecureRandom.hex(16)
        application = Application.new(application_params.merge(token: token))
        if application.save

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'f8dead5815c603ce926d2704be4687c6' LIMIT 1
UPDATE `applications` SET `applications`.`name` = 'app 4', `applications`.`updated_at` = '2025-11-11 17:54:38.299955' WHERE `applications`.`id` = 4
---
    def update_by_token
        application = Application.find_by(token: params[:token])

        if application.nil?
            render json: { error: "Application not found" }, status: :unauthorized
        elsif application.update(name: application_params[:name])